# SATExportOptions Constructor (SATExportOptions)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SATExportOptions Constructor (SATExportOptions)
SATExportOptions Class See Also
---
Constructs a new instance of SATImportOptions as a copy of the export options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SATExportOptions(
	SATExportOptions option
)
```

Visual Basic
---
```text
Public Sub New ( _
	option As SATExportOptions _
)
```

Visual C++
---
```text
public:
SATExportOptions(
	SATExportOptions^ option
)
```

# ### Parameters
option
    Type: Autodesk.Revit.DB..::..SATExportOptions The options to be copied.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SATExportOptions Class
SATExportOptions Overload
Autodesk.Revit.DB Namespace